Documents/Requests/Soap_GetIPEquipmentFeatures- A_06_05_2022_10_02_05_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vfd="http://amdocs/vfde/equipment/VFDEGetIpEquipmentFeatures" xmlns:vfd1="http://amdocs/vfde/equipment/VFDEGetIpEquipmentFeaturesInput">
  <soapenv:Header />
  <soapenv:Body>
    <vfd:GetIpEquipmentFeaturesRequest>
      <vfd1:ROOT>
        <Event>
          <Type>GetIpEquipmentFeatures</Type>
          <ID>58866e0fa724f</ID>
          <!--Optional:-->
          <CallerID>Omnius</CallerID>
          <!--Optional:-->
          <CorrelationID>0028lab4cd3fgt9iftm9eoolqrlsnonl</CorrelationID>
          <!--Optional:-->
          <!--Optional:-->
          <!--Optional:-->
          <!--Optional:-->
          <MessageCreationTimestamp>2017-01-23T20:56:47</MessageCreationTimestamp>
          <!--Optional:-->
          <FrontendUserId>4</FrontendUserId>
          <!--Optional:-->
          <DealerCode>00180000</DealerCode>
          <!--Optional:-->
          <SalesChannel>retail</SalesChannel>
          <!--Optional:-->
          <!--Optional:-->
        </Event>
        <DATA>
          <!--You have a CHOICE of the next 2 items at this level-->
          <!--Optional:-->
          <Manufacturer>MO</Manufacturer>
          <!--Optional:-->
          <ConverterType>KM</ConverterType>
          <!--Optional:-->
          <MacAddress>0023a328fb84</MacAddress>
        </DATA>
      </vfd1:ROOT>
    </vfd:GetIpEquipmentFeaturesRequest>
  </soapenv:Body>
</soapenv:Envelope>